---
kind: method
id: M:Autodesk.Revit.DB.AssemblyDifference.Dispose
source: html/4fc9a0c8-4b6a-a45b-ae52-a60c2cd3f6af.htm
---
# Autodesk.Revit.DB.AssemblyDifference.Dispose Method

Releases all resources used by the AssemblyDifference

## Syntax (C#)
```csharp
public void Dispose()
```